app/Controllers/Admin.php

    public function required()
    {
        $data["setting_mstr"] = $this->setting_mstr->findAll();

        $this->user_mstr->join('role_mstr', 'role_mstr.role_code = user_mstr.user_role');
        $data["user_mstr"] = $this->user_mstr->find($_SESSION['session_admin']['user_id']);
---
SELECT *
FROM `setting_mstr`
SELECT *
FROM `user_mstr`
JOIN `role_mstr` ON `role_mstr`.`role_code` = `user_mstr`.`user_role`
WHERE `user_mstr`.`user_id` = '1220003'

    public function item()
    {
        $data = $this->required();

        $data["measure_es"] = $this->measure_mstr->findAll();
        $this->item_group->where(["itemg_code !=" => "ITMG-BAHANBAKU"]);
        $data["item_group_es"] = $this->item_group->findAll();
---
SELECT *
FROM `measure_mstr`
SELECT *
FROM `item_group`
WHERE `itemg_code` != 'ITMG-BAHANBAKU'

    public function sq_invoice($sq_code = null)
    {
        if ($sq_code) {
            $this->sq_mstr->where(["sq_code" => $sq_code]);
            $data = $this->sq_mstr->first();

            if ($data) {
                $data = $this->required();
                // $data['pr_code'] = $pr_code;

                $this->sq_mstr->select("
                    *,
                    DATE_FORMAT(sq_add_date, '%d/%m/%y') AS _sq_add_date,
                    DATE_FORMAT(sq_upd_date, '%W, %d %M %Y - %H:%i:%s') AS _sq_upd_date
                ");
                $this->sq_mstr->join("user_mstr", "user_mstr.user_id = sq_mstr.sq_user");
                $data["sq"] = $this->sq_mstr->find($sq_code);

                $this->sqd_detail->join("item_mstr", "item_mstr.item_code = sqd_detail.sqd_item");
                $this->sqd_detail->where(["sqd_sq" => $sq_code]);
                $data["sqd_es"] = $this->sqd_detail->findAll();
---
SELECT *
FROM `sq_mstr`
WHERE `sq_code` = 'SQ-230113-000206'
 LIMIT 1
SELECT *, DATE_FORMAT(sq_add_date, '%d/%m/%y') AS _sq_add_date, DATE_FORMAT(sq_upd_date, '%W, %d %M %Y - %H:%i:%s') AS _sq_upd_date
FROM `sq_mstr`
JOIN `user_mstr` ON `user_mstr`.`user_id` = `sq_mstr`.`sq_user`
WHERE `sq_mstr`.`sq_code` = 'SQ-230113-000206'
SELECT *
FROM `sqd_detail`
JOIN `item_mstr` ON `item_mstr`.`item_code` = `sqd_detail`.`sqd_item`
WHERE `sqd_sq` = 'SQ-230113-000206'