app/Controllers/Item.php

    public function get_item($active = "Y")
    {
        try {
            $ps_item = $this->request->getJsonVar("ps_item");
            $item_type = $this->request->getJsonVar("item_type");

            $this->item_mstr->join("item_group", "item_group.itemg_code = item_mstr.item_group");
            $this->item_mstr->join("measure_mstr", "measure_mstr.measure_code = item_mstr.item_measure");

            if ($ps_item != null) {
                $this->item_mstr->where(["item_code !=" => $ps_item]);
            }

            if ($item_type != null) {
                $this->item_mstr->wherein("item_type", $item_type);
            }

            if ($active != "all") {
                $this->item_mstr->where(["item_active" => $active]);
            }

            $this->item_mstr->orderBy('item_type ASC, item_group ASC, item_name ASC');
            $data = $this->item_mstr->findAll();
---
SELECT *
FROM `item_mstr`
JOIN `item_group` ON `item_group`.`itemg_code` = `item_mstr`.`item_group`
JOIN `measure_mstr` ON `measure_mstr`.`measure_code` = `item_mstr`.`item_measure`
WHERE `item_type` IN ('JL','BJ')
AND `item_active` = 'Y'
ORDER BY `item_type` ASC, `item_group` ASC, `item_name` ASC

    public function add_item()
    {
        try {
            $validation =  \Config\Services::validation();
            $validation->setRules([
                "item_code" => "required",
            ]);
            $isDataValid = $validation->withRequest($this->request)->run();

            if ($isDataValid) {
                $item_code = $this->request->getPost("item_code");

                $this->item_mstr->join("measure_mstr", "measure_mstr.measure_code = item_mstr.item_measure");
                $checking_item = $this->item_mstr->find($item_code);
---
SELECT *
FROM `item_mstr`
JOIN `measure_mstr` ON `measure_mstr`.`measure_code` = `item_mstr`.`item_measure`
WHERE `item_mstr`.`item_code` = 'CFF-TBRK'