app/Controllers/Sq.php

SELECT *
FROM `sq_mstr`
WHERE `sq_code` = 'SQ-230113-000206'
 LIMIT 1
---
                        $sq->db->transCommit();
                        $sqd->db->transCommit();

                        $temp = $this->sq_mstr->where([
                            "sq_code" => $sq_code,
                        ])->first();