app/Controllers/User.php

    public function update_user()
    {
        try {
            $validation =  \Config\Services::validation();
            $validation->setRules([
                "user_id" => "required",
                "user_name" => "required",
                "user_full_name" => "required",
                "user_email" => "required",
            ]);
            $isDataValid = $validation->withRequest($this->request)->run();

            if ($isDataValid) {
                $user_id = $this->request->getPost("user_id");
                $user_name = $this->request->getPost("user_name");
                $user_full_name = $this->request->getPost("user_full_name");
                $user_email = $this->request->getPost("user_email");

                $status = $this->user_mstr->update($user_id, [
                    "user_name" => $user_name,
                    "user_full_name" => $user_full_name,
                    "user_email" => $user_email,
                ]);

                if ($status) {
                    $temp = $this->user_mstr->where([
                        "user_id" => $user_id,
                    ])->first();
---
UPDATE `user_mstr` SET `user_name` = 'admin_cashier', `user_full_name` = 'Nindi Arnelti', `user_email` = 'nindiarnelti@gmail.com'
WHERE `user_mstr`.`user_id` IN ('1220003')
SELECT *
FROM `user_mstr`
WHERE `user_id` = '1220003'
 LIMIT 1