app/Models/User_Mstr_Model.php

    function get_User_Name($user_name)
    {
        $builder = $this->table("user_mstr");
        $data = $builder->where("user_name", $user_name)->first();
---
SELECT *
FROM `user_mstr`
WHERE `user_name` = 'admin_cashier'
 LIMIT 1